** let-polymorphism

ML has a construct for binding local variables called "let". This is
should be familar to Lisp (and now JavaScript) programmers, it's just
a way of assigning values to names that are scoped to a specific
block:

#+BEGIN_SRC sml let
  let
     val x = 1
     val y = 2
     fun square z = z * z
  in
     square x + y
  end
#+END_SRC

Coming from a Lisp background, I always thought of let as just
syntactic sugar, since it can be written as a trivial macro
transforming it into a lambda and an application (JavaScript
programmers call this pattern "Immediately Invoked Function
Expression", or IIFEs).

#+BEGIN_SRC sml
  val y = 
      let
         val x = 3
      in
         x + x
      end
  
  (* transformed into: *)
  
  val y =
   (fn x => x + x) 3
#+END_SRC

(in JavaScript?)

But it turns out that in ML there is a really subtle semantic
difference between these two kinds of bindings (TODO: introduce
let-bound and lambda-bound). ML's type system implements something
called "let-polymorphism" which boils down to this: let-bound
variables may have a polymorphic type, while lambda-bound variables
may not (TODO: ???).

#+BEGIN_SRC sml
  val _ = (fn id => (id 3, id true)) (fn x => x)
#+END_SRC

#+RESULTS:
: stdIn:27.19-27.34 Error: operator and operand don't agree [literal]
:   operator domain: int
:   operand:         bool
:   in expression:

In the first example it's inferred to be int -> int after the first
part of the pair is encountered by the type checker, and the second
part of the pair results in a type checking error.

#+BEGIN_SRC sml
  let
      val id = fn x => x
  in
      (id 3, id true)
  end
#+END_SRC

#+RESULTS:
: val it = (3,true) : int * bool

In the second example, the type of `id` is `'a -> 'a`, and when the
type checker encounters `id 3` it says, ok you're applying a function
with type `'a -> 'a` to `3`, that's cool the result is going to be the
same type as `3`. When it sees `id true` is does something similar,
and the first part of the pair doesn't influence the type checking of
the second (???).

The way you implement this, in the naive case, is LITERALLY by copying code around. The compiler will transform the syntax tree with a single instance of the `id` function into a new tree with two instances, for the two different applications. The result is something like:

#+BEGIN_SRC sml
  let
      val id1 = fn x => x
      val id2 = fn x => x
  in
      (id1 3, id2 true)
  end
#+END_SRC

This is crazy, right? I mean it's actually copying and pasting code
around so that you don't have to.

